{"backend": "tensorflow", "keras_version": "2.0.1", "config": [{"config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 416, 416, 3]}, "class_name": "InputLayer"}, {"config": {"trainable": true, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 64, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_1", "bias_constraint": null, "kernel_constraint": null, "data_format": "channels_last", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 64, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_2", "bias_constraint": null, "kernel_constraint": null, "data_format": "channels_last", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"padding": "same", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 128, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_3", "bias_constraint": null, "kernel_constraint": null, "data_format": "channels_last", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 128, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_4", "bias_constraint": null, "kernel_constraint": null, "data_format": "channels_last", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"padding": "same", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 256, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_5", "bias_constraint": null, "kernel_constraint": null, "data_format": "channels_last", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 256, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_6", "bias_constraint": null, "kernel_constraint": null, "data_format": "channels_last", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 256, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_7", "bias_constraint": null, "kernel_constraint": null, "data_format": "channels_last", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"padding": "same", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_3", "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 512, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_8", "bias_constraint": null, "kernel_constraint": null, "data_format": "channels_last", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 512, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_9", "bias_constraint": null, "kernel_constraint": null, "data_format": "channels_last", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 512, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_10", "bias_constraint": null, "kernel_constraint": null, "data_format": "channels_last", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"padding": "same", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_4", "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 512, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_11", "bias_constraint": null, "kernel_constraint": null, "data_format": "channels_last", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 512, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_12", "bias_constraint": null, "kernel_constraint": null, "data_format": "channels_last", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 512, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_13", "bias_constraint": null, "kernel_constraint": null, "data_format": "channels_last", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"padding": "same", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_5", "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"trainable": true, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 125, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "kernel_size": [1, 1], "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_14", "bias_constraint": null, "kernel_constraint": null, "data_format": "channels_last", "use_bias": true}, "class_name": "Conv2D"}], "class_name": "Sequential"}