{"class_name": "Sequential", "config": [{"class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "name": "input_1", "batch_input_shape": [null, 416, 416, 3]}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "data_format": "channels_last", "name": "conv2d_1", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_regularizer": null, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "data_format": "channels_last", "name": "conv2d_2", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_regularizer": null, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "same", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "data_format": "channels_last", "name": "conv2d_3", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "kernel_regularizer": null, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "data_format": "channels_last", "name": "conv2d_4", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "kernel_regularizer": null, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "same", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "data_format": "channels_last", "name": "conv2d_5", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "kernel_regularizer": null, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "data_format": "channels_last", "name": "conv2d_6", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "kernel_regularizer": null, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "data_format": "channels_last", "name": "conv2d_7", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "kernel_regularizer": null, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_3", "pool_size": [2, 2], "padding": "same", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "data_format": "channels_last", "name": "conv2d_8", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "kernel_regularizer": null, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "data_format": "channels_last", "name": "conv2d_9", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "kernel_regularizer": null, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "data_format": "channels_last", "name": "conv2d_10", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "kernel_regularizer": null, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_4", "pool_size": [2, 2], "padding": "same", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "data_format": "channels_last", "name": "conv2d_11", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "kernel_regularizer": null, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "data_format": "channels_last", "name": "conv2d_12", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "kernel_regularizer": null, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "data_format": "channels_last", "name": "conv2d_13", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "kernel_regularizer": null, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_5", "pool_size": [2, 2], "padding": "same", "strides": [2, 2]}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true, "epsilon": 0.001, "name": "batch_normalization_1", "beta_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "name": "dropout_1"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_size": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "kernel_constraint": null, "data_format": "channels_last", "name": "conv2d_14", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 125, "kernel_regularizer": null, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1]}}], "backend": "tensorflow", "keras_version": "2.0.4"}