{"backend": "tensorflow", "config": [{"config": {"sparse": false, "dtype": "float32", "name": "input_1", "batch_input_shape": [null, 416, 416, 3]}, "class_name": "InputLayer"}, {"config": {"activation": "relu", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_constraint": null, "name": "conv2d_1", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "trainable": true, "filters": 64}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_constraint": null, "name": "conv2d_2", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "trainable": true, "filters": 64}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true, "padding": "same"}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_constraint": null, "name": "conv2d_3", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "trainable": true, "filters": 128}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_constraint": null, "name": "conv2d_4", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "trainable": true, "filters": 128}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true, "padding": "same"}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_constraint": null, "name": "conv2d_5", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "trainable": true, "filters": 256}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_constraint": null, "name": "conv2d_6", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "trainable": true, "filters": 256}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_constraint": null, "name": "conv2d_7", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "trainable": true, "filters": 256}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last", "trainable": true, "padding": "same"}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_constraint": null, "name": "conv2d_8", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "trainable": true, "filters": 512}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_constraint": null, "name": "conv2d_9", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "trainable": true, "filters": 512}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_constraint": null, "name": "conv2d_10", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "trainable": true, "filters": 512}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_4", "data_format": "channels_last", "trainable": true, "padding": "same"}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_constraint": null, "name": "conv2d_11", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "trainable": true, "filters": 512}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_constraint": null, "name": "conv2d_12", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "trainable": true, "filters": 512}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_constraint": null, "name": "conv2d_13", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "trainable": true, "filters": 512}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_5", "data_format": "channels_last", "trainable": true, "padding": "same"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "padding": "same", "kernel_constraint": null, "name": "conv2d_14", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "trainable": true, "filters": 125}, "class_name": "Conv2D"}], "class_name": "Sequential", "keras_version": "2.0.4"}